# Introduction

Pandas est une librairie python qui permet de manipuler facilement des données à analyser :

+ manipuler des tableaux de données avec des étiquettes de variables (colonnes) et d'individus (lignes).
+ ces tableaux sont appelés DataFrames, similaires aux dataframes sous R.
+ on peut facilement lire et écrire ces dataframes à partir ou vers un fichier tabulé.
+ on peut faciler tracer des graphes à partir de ces DataFrames grâce à matplotlib.

# Séries

Les séries sur **Pandas** sont des tableaux étiquetés unidimensionnel capable de contenir des données de tout type (entier, string, float, objects, etc.). Les étiquettes sont appelées le plus souvent index. Nous pouvons voir une série comme une colonne sur une feuille Excel.

Avant tout d'abord, il faut commencé par importer **pandas**

In [1]:
import pandas as pd
pd.Series?

## Création d'une séries

Les Séries sur **pandas** peuvent etre créer à partir d'une liste, d'un tableau, d'un dictionnaire, d'un scalaire, etc.

### Création d'une série à partir d'une liste

In [2]:
etudiants = ['Ngor', 'Niokhor', 'Dibor']
pd.Series(etudiants)

0       Ngor
1    Niokhor
2      Dibor
dtype: object

In [3]:
nombres = [1, 2, 3]
pd.Series(nombres)

0    1
1    2
2    3
dtype: int64

In [4]:
etudiants = ['Ngor', 'Niokhor', None]
pd.Series(etudiants)

0       Ngor
1    Niokhor
2       None
dtype: object

In [5]:
nombres = [1, 2, None]
pd.Series(nombres)

0    1.0
1    2.0
2    NaN
dtype: float64

### Création d'une série à partir d'un tableau numpy

In [6]:
import numpy as np

etudiants = np.array(['Ngor','Niokhor','Dibor','Gnilane'])
 
ser = pd.Series(etudiants)
print(ser)

0       Ngor
1    Niokhor
2      Dibor
3    Gnilane
dtype: object

### Création d'une série à partir d'un dictionnaire

In [7]:
sports = {'Tir à l\'arc': 'Bhutan',
          'Golf': 'Ecosse',
          'Sumo': 'Japon',
          'Taekwondo': 'Corée du Sud'}
s = pd.Series(sports)
s

Tir à l'arc          Bhutan
Golf                 Ecosse
Sumo                  Japon
Taekwondo      Corée du Sud
dtype: object

Afficher les indexes

In [10]:
s.index

Index(['Tir à l'arc', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

Afficher les valeurs

In [11]:
s.values

array(['Bhutan', 'Ecosse', 'Japon', 'Corée du Sud'], dtype=object)

L'index peut etre défini au moment de la création

In [12]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [13]:
sports = {'Tir à l\'arc': 'Bhutan',
          'Golf': 'Ecosse',
          'Sumo': 'Japon',
          'Taekwondo': 'Corée du Sud'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Ecosse
Sumo       Japon
Hockey       NaN
dtype: object

# DataFrame

Les Dataframes sont des tableaux à deux dimensions, avec des variables en colonnes et des observations en ligne. Les colonnes et lignes des dataframes sont indexées.

### Création de dataframes à partir d’un dictionnaire

Pour créer un dataframe, on peut fournir à la fonction DataFrame() de pandas un dictionnaire pouvant être transformé en serie. C’est le cas d’un dictionnaire dont les valeurs associées aux clés ont toutes la même longueur :

In [14]:
dico = {"height" : 
               [58, 59, 60, 61, 62,
                63, 64, 65, 66, 67,
                68, 69, 70, 71, 72],
        "weight": 
               [115, 117, 120, 123, 126,
                129, 132, 135, 139, 142,
                146, 150, 154, 159, 164]
       }

In [16]:
df = pd.DataFrame(dico)
print(df)

    height  weight
0       58     115
1       59     117
2       60     120
3       61     123
4       62     126
5       63     129
6       64     132
7       65     135
8       66     139
9       67     142
10      68     146
11      69     150
12      70     154
13      71     159
14      72     164

Afficher les colonnes

In [19]:
df.columns

Index(['height', 'weight'], dtype='object')

### head() et tail()

Les méthodes head() et tail() permettent d’afficher les premières lignes (les 5 premières, par défaut) ou les dernières lignes (les 5 dernières, par défaut). On peut ajouter le paramètre **n** pour afficher **n** lignes

In [20]:
#Afficher les 5 premières lignes
df.head()

   height  weight
0      58     115
1      59     117
2      60     120
3      61     123
4      62     126

In [21]:
#Afficher les 5 premières lignes
df.tail()

    height  weight
10      68     146
11      69     150
12      70     154
13      71     159
14      72     164

Lors de la création d'un **DataFrame**, on peut indiquer les colonnes en paramètre ou bien définir l'ordre d'apparition des colonnes

In [22]:
df = pd.DataFrame(dico, columns = ["weight", "height"])
print(df.head(2))

   weight  height
0     115      58
1     117      59

In [23]:
df = pd.DataFrame(dico, columns = ["weight"])
print(df.head(2))

   weight
0     115
1     117

**NB:** Si on indique un nom de colonne absent parmi les clés du dictionnaires, le dataframe résultant contiendra une colonne portant ce nom mais remplie de valeurs NaN

In [24]:
df = pd.DataFrame(dico, columns = ["weight", "height", "age"])
print(df.head(2))

   weight  height  age
0     115      58  NaN
1     117      59  NaN

### Création de dataframes à partir d’une série

In [28]:
s = pd.Series([1, 4, -1, np.nan], index = ["o", "d", "i", "l"])
s.name = "nom_variable"
df = pd.DataFrame(s, columns = ["nom_variable"])
print(df)

   nom_variable
o           1.0
d           4.0
i          -1.0
l           NaN

**NB:** Si on n’attribue pas de nom à la série, il suffit de ne pas renseigner le paramètre columns de la fonction DataFrame. Mais dans ce cas, la colonne n’aura pas de non, juste un index numérique.

In [29]:
s = pd.Series([1, 4, -1, np.nan], index = ["o", "d", "i", "l"])
df = pd.DataFrame(s)
print(df)

     0
o  1.0
d  4.0
i -1.0
l  NaN

### Création de dataframes à partir d’une liste de dictionnaire

In [30]:
dico_1 = {
    "Nom": "Pendragon",
    "Prenom": "Arthur",
    "Role": "Roi de Bretagne"
}
dico_2 = {
    "Nom": "de Galles",
    "Prenom": "Perceval",
    "Role": "Chevalier du Pays de Galles"
}

In [31]:
df = pd.DataFrame([dico_1, dico_2])
print(df)

         Nom    Prenom                         Role
0  Pendragon    Arthur              Roi de Bretagne
1  de Galles  Perceval  Chevalier du Pays de Galles

### Remarque: Dans la pratique, nous allons importer des fichiers excel, csv, sql, etc.

In [37]:
df=pd.read_csv('donnees/housing.csv')

In [38]:
df.head(2)

      RM  LSTAT  PTRATIO      MEDV
0  6.575   4.98     15.3  504000.0
1  6.421   9.14     17.8  453600.0

# Manipulation des DataFrame

## Series

In [39]:
df = pd.read_csv('donnees/imdb_1000.csv')
df = df.set_index("title")

df.head()

,star_rating,content_rating,genre,duration,actors_list
title,,,,,
The Shawshank Redemption,9.3,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
The Godfather,9.2,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
The Godfather: Part II,9.1,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
The Dark Knight,9.0,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
Pulp Fiction,8.9,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [40]:
df['content_rating']

title
The Shawshank Redemption                               R
The Godfather                                          R
The Godfather: Part II                                 R
The Dark Knight                                    PG-13
Pulp Fiction                                           R
                                                   ...
Tootsie                                               PG
Back to the Future Part III                           PG
Master and Commander: The Far Side of the World    PG-13
Poltergeist                                           PG
Wall Street                                            R
Name: content_rating, Length: 979, dtype: object

In [41]:
type(df['content_rating'])

pandas.core.series.Series

In [42]:
df['content_rating'].values

array(['R', 'R', 'R', 'PG-13', 'R', 'NOT RATED', 'NOT RATED', 'PG-13',
       'R', 'R', 'PG-13', 'PG-13', 'PG', 'PG-13', 'PG-13', 'PG-13', 'R',
       'UNRATED', 'R', 'PG', 'R', 'R', 'APPROVED', 'R', 'R', 'PG-13',
       'PG-13', 'R', 'R', 'PASSED', 'PG', 'R', 'PG', 'R', 'R', 'G', 'R',
       'PG', 'APPROVED', 'R', 'R', 'NOT RATED', 'R', 'PG-13', 'R', 'R',
       'R', 'PG', 'PG', 'R', 'R', 'R', 'APPROVED', 'PG-13', 'PG', 'G',
       'R', 'R', 'APPROVED', 'R', 'PG-13', 'UNRATED', 'R', 'NOT RATED',
       'G', 'APPROVED', 'NOT RATED', 'R', 'R', 'PG-13', 'R', 'APPROVED',
       'NOT RATED', 'PG-13', 'APPROVED', 'R', 'APPROVED', 'R', 'R',
       'PASSED', 'PG', 'G', 'R', 'NOT RATED', 'R', 'PG', 'X', 'NOT RATED',
       'NOT RATED', 'NOT RATED', 'R', 'R', 'R', 'NOT RATED', 'APPROVED',
       'APPROVED', 'UNRATED', 'PG', 'UNRATED', 'R', 'NOT RATED', 'PG',
       'R', 'APPROVED', 'NOT RATED', 'NOT RATED', 'R', 'APPROVED',
       'NOT RATED', 'NOT RATED', 'G', 'NOT RATED', 'R', 'PG-13', 'R', 'R',
       'NOT RATED', 'G', 'PG-13', 'R', 'UNRATED', 'R', 'NOT RATED',
       'UNRATED', 'R', 'R', 'PG', 'UNRATED', 'NOT RATED', 'R', 'R', 'G',
       'NOT RATED', 'NOT RATED', 'NOT RATED', 'R', 'R', 'PG', 'R', 'R',
       'NOT RATED', 'R', 'PG', 'R', 'UNRATED', 'R', 'PG-13', 'PG', 'PG',
       'NOT RATED', 'R', 'R', 'R', 'R', 'PG', 'R', 'R', 'G', 'R',
       'PASSED', 'PG', 'UNRATED', 'R', 'R', 'R', 'NOT RATED', 'R',
       'NOT RATED', 'G', 'NOT RATED', 'PG-13', 'PG', 'R', 'R',
       'NOT RATED', 'PG-13', 'R', 'PG-13', 'NOT RATED', 'PG', 'PG-13',
       'NOT RATED', 'NOT RATED', 'NOT RATED', 'R', 'R', 'R', nan,
       'NOT RATED', 'R', 'R', 'PG-13', 'G', 'PG', 'R', 'R', 'PG-13', 'R',
       'R', 'R', 'PG', 'R', 'R', 'NOT RATED', 'G', 'R', 'R', 'APPROVED',
       'PG', 'PG-13', 'APPROVED', 'PG-13', 'R', 'R', 'R', 'NOT RATED',
       'R', 'UNRATED', 'R', 'TV-MA', 'PG', 'PG', 'PG-13', 'R', 'PASSED',
       'R', 'R', 'PG-13', 'R', 'APPROVED', 'APPROVED', 'NOT RATED',
       'PG-13', 'APPROVED', 'NOT RATED', 'R', 'PG', 'APPROVED', 'R',
       'UNRATED', 'PG-13', 'PG', 'R', 'R', 'R', 'PG', 'NOT RATED', 'R',
       'PG-13', 'PG', 'PG', 'APPROVED', 'NOT RATED', 'APPROVED',
       'NOT RATED', 'NOT RATED', 'R', 'UNRATED', 'UNRATED', 'PG-13',
       'PG-13', 'R', 'UNRATED', 'NOT RATED', 'R', 'NOT RATED', 'PG', 'PG',
       'R', 'PG', 'PG-13', 'PG-13', 'APPROVED', 'R', 'R', 'PG', 'R', 'G',
       'R', 'PG-13', 'PG', 'R', 'GP', 'R', 'PG', 'APPROVED', 'PG-13',
       'APPROVED', 'R', 'UNRATED', 'R', 'UNRATED', 'APPROVED', 'PASSED',
       'G', 'PG', 'R', 'PG', 'APPROVED', 'PG-13', 'R', 'PG-13', 'GP',
       'PG', 'PG', 'PG-13', 'R', 'PG', 'R', 'R', 'PG-13', 'R', 'PG-13',
       'G', 'PG-13', 'NOT RATED', 'R', 'UNRATED', 'R', 'R', 'R', 'R', 'R',
       'R', 'R', 'R', 'R', 'PG', 'NOT RATED', 'APPROVED', 'UNRATED', 'R',
       'G', 'APPROVED', 'R', 'PG-13', 'PG', 'R', 'UNRATED', 'PG-13',
       'PG-13', 'PG-13', 'PG', 'NOT RATED', 'R', 'R', 'R', 'PG', 'G', 'R',
       'APPROVED', 'UNRATED', 'R', 'UNRATED', 'R', 'R', 'PG-13', 'G',
       'PASSED', 'PG-13', 'R', 'G', 'PG-13', 'R', 'R', 'R', 'PG-13', 'R',
       'G', 'R', 'PG-13', 'R', 'R', 'PG-13', 'R', 'R', 'UNRATED', 'PG-13',
       'PG', 'PG-13', 'PG-13', 'PG', 'R', 'R', 'UNRATED', 'PG-13', 'PG',
       'X', 'R', 'UNRATED', 'R', 'PG-13', 'R', 'PG', 'R', 'PG', 'R',
       'PG-13', 'PG', 'R', 'PG-13', 'R', 'R', 'PG-13', 'PG', 'NOT RATED',
       'R', 'R', 'PG-13', 'R', 'APPROVED', 'PG-13', 'UNRATED', 'R', 'G',
       'R', 'R', 'R', 'R', 'NOT RATED', 'PG', 'PG', 'R', 'R', 'R', 'PG',
       'R', 'NOT RATED', 'PG-13', 'R', 'R', 'R', 'R', 'PG-13', 'PG-13',
       'R', 'R', 'PG-13', 'R', 'PG-13', 'R', 'R', 'PG-13', 'PG',
       'APPROVED', 'APPROVED', 'R', 'PG-13', 'PG', 'R', 'R', 'APPROVED',
       'R', 'NOT RATED', 'R', 'PG-13', 'NC-17', 'R', 'R', 'PG-13',
       'PG-13', 'G', 'R', 'R', 'R', 'R', 'R', 'UNRATED', 'PG', 'R', 'R',
       'PG', 'UNRATED', 'R', 'R', 'R', 'PG-13', 'PG-13', 'NOT RATED', 'R',
       'R', 'NOT RATED', 'R', 'R', 'APPROVED', 'R', 'X', 'PG-13', 'PG-13',
       'PG-13', 'R', 'NOT RATED', 'R', 'R', 'PG', 'PG', 'R', 'G', 'G',
       'PG-13', 'R', 'PG', 'R', 'PG-13', 'PG', 'R', 'R', 'PG-13', 'PG-13',
       'R', 'PG-13', 'PG-13', 'PG', 'APPROVED', 'PG', 'R', 'PG', 'PG-13',
       'PG', 'R', 'PG', 'APPROVED', 'PG-13', 'UNRATED', 'PG', 'PG',
       'UNRATED', 'R', 'NOT RATED', 'R', 'R', 'NOT RATED', 'PG-13', 'R',
       'G', 'PG', 'PG-13', 'PG', 'R', 'PG-13', 'PG-13', 'R', 'PG-13', 'R',
       'R', 'R', 'NOT RATED', 'PG', 'R', 'R', 'PG-13', 'PG', 'R', 'R',
       'PG-13', 'R', 'R', 'APPROVED', 'R', 'R', 'R', 'R', 'PG-13',
       'APPROVED', 'R', 'PG', 'R', 'PG-13', 'PG-13', 'PG-13', 'R', 'R',
       'PG-13', 'NOT RATED', 'R', 'APPROVED', 'R', 'PG-13', 'PG-13',
       'PG-13', 'PG', 'R', 'UNRATED', 'R', 'R', 'PG', 'PG', 'R', 'R', 'R',
       'PG', 'PG-13', 'NOT RATED', 'R', 'R', 'PG', 'R', 'R', 'R', 'R',
       'R', 'R', 'R', 'R', 'NC-17', 'PG-13', 'R', 'R', 'R', 'R', 'R', 'R',
       'APPROVED', 'R', 'R', 'R', 'R', 'PG', 'APPROVED', 'PASSED',
       'PG-13', 'R', 'PG-13', 'PG-13', 'R', 'G', 'PG-13', 'PG-13', 'R',
       'PG-13', 'PG-13', 'UNRATED', 'R', 'R', 'PG', 'R', 'R', 'R', 'R',
       'PG-13', 'R', 'PG', 'PG-13', 'PG-13', 'PG-13', 'PG', 'R',
       'NOT RATED', 'R', nan, 'R', 'R', 'UNRATED', 'PG-13', 'R', 'R',
       'APPROVED', 'PG', 'PG-13', 'R', 'PG-13', 'PG-13', 'PG-13', 'R',
       'PG', 'NOT RATED', 'R', 'PG-13', 'G', 'PG', 'R', 'R', 'R',
       'NOT RATED', 'G', 'R', 'R', 'R', 'PG-13', 'PG-13', 'PG-13', 'R',
       'PG-13', 'R', 'PG-13', 'R', 'PG-13', 'UNRATED', 'R', 'PG-13', 'R',
       'GP', 'R', 'R', 'R', 'R', 'PG-13', 'R', 'R', 'PG-13', 'R', 'R',
       'R', 'APPROVED', 'R', 'PG-13', 'PG-13', 'R', 'R', 'PG-13', 'R',
       'R', 'R', 'APPROVED', 'R', 'NC-17', 'R', 'R', 'PG-13', 'R', 'R',
       'R', 'R', 'R', 'R', 'R', 'PG-13', 'PG-13', 'R', 'R', 'UNRATED',
       'R', 'R', 'R', 'R', 'PG-13', 'PG-13', 'PG', 'R', 'R', 'R', 'R',
       'R', 'PG', 'R', 'R', 'R', 'R', 'PG', 'R', 'R', 'PG-13', 'R', 'PG',
       'PG', 'NC-17', 'PG-13', 'UNRATED', 'PG-13', 'G', 'R', 'R', 'R',
       'NOT RATED', 'PG', 'R', 'G', 'APPROVED', 'R', 'R', 'R', 'R', 'PG',
       'R', 'R', 'PG', 'PG-13', 'PG-13', 'R', 'R', 'R', 'R', 'PG-13', 'R',
       'R', 'R', 'R', 'PG-13', 'R', 'PG', 'PG-13', 'R', 'R', 'R', 'PG',
       'R', 'NC-17', 'R', 'R', 'R', 'PG', 'PG-13', 'UNRATED', 'R',
       'PG-13', 'PG-13', 'PG-13', 'R', 'R', 'PG-13', 'PG-13', 'R',
       'PG-13', 'PG', 'PG-13', 'R', 'PG', 'PG-13', 'R', 'R', 'G', 'PG-13',
       'PG', 'UNRATED', 'PG-13', 'PG', 'R', 'NOT RATED', 'R', 'R', 'R',
       'R', 'R', 'R', 'R', 'PG', 'R', 'R', 'PG-13', 'R', 'R', 'R', 'R',
       'R', 'APPROVED', 'PG-13', 'R', 'R', 'PG', 'PG-13', 'PG', 'PG-13',
       'PG', 'PG', 'PG', 'R', 'PG-13', 'PG-13', 'PG-13', 'PG-13', 'R',
       'R', 'R', 'R', 'R', 'PG-13', 'APPROVED', 'PG-13', 'PG-13', 'R',
       'R', 'PG-13', 'R', 'R', 'PG-13', 'R', 'PG-13', 'R', 'R', 'R', 'R',
       'R', 'G', 'R', 'R', 'R', 'R', 'R', 'PG-13', 'R', 'R', 'PG', 'R',
       'R', 'PG-13', 'R', 'APPROVED', 'R', 'PG', 'NOT RATED', 'R', 'R',
       'R', 'R', 'R', 'R', 'R', 'R', 'PG', 'PG', 'R', 'R', 'R', 'X', 'R',
       'NC-17', 'R', 'R', 'R', 'R', 'R', 'R', 'PG-13', 'PG-13', 'PG-13',
       'R', 'R', 'R', 'R', 'PG-13', 'R', 'R', 'PG-13', 'PG', 'PG-13', 'R',
       nan, 'PG', 'G', 'R', 'PG-13', 'PG', 'PG-13', 'PG-13', 'R', 'R',
       'PG-13', 'UNRATED', 'R', 'PG', 'R', 'R', 'R', 'PG', 'PG-13', 'R',
       'PG', 'R', 'PG-13', 'R', 'PG-13', 'R', 'PG', 'R', 'PG-13', 'PG-13',
       'PG-13', 'R', 'R', 'R', 'R', 'R', 'NC-17', 'PG-13', 'PG', 'PG',
       'PG-13', 'PG', 'R'], dtype=object)

In [43]:
print(type(df['content_rating'].values))

<class 'numpy.ndarray'>

In [44]:
df[["duration", "genre"]]

                                                 duration      genre
title
The Shawshank Redemption                              142      Crime
The Godfather                                         175      Crime
The Godfather: Part II                                200      Crime
The Dark Knight                                       152     Action
Pulp Fiction                                          154      Crime
...                                                   ...        ...
Tootsie                                               116     Comedy
Back to the Future Part III                           118  Adventure
Master and Commander: The Far Side of the World       138     Action
Poltergeist                                           114     Horror
Wall Street                                           126      Crime

[979 rows x 2 columns]

In [45]:
# Rows:
df.iloc[0] # First row of DataFrame
df.iloc[1] # Second row of DataFrame
df.iloc[-1] # Last row of DataFrame

# Columns:
df.iloc[:,0] # First column of DataFrame
df.iloc[:,1] # Second column of DataFrame
df.iloc[:,-1] # Last column of DataFrame

title
The Shawshank Redemption                           [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
The Godfather                                        [u'Marlon Brando', u'Al Pacino', u'James Caan']
The Godfather: Part II                             [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
The Dark Knight                                    [u'Christian Bale', u'Heath Ledger', u'Aaron E...
Pulp Fiction                                       [u'John Travolta', u'Uma Thurman', u'Samuel L....
                                                                         ...
Tootsie                                            [u'Dustin Hoffman', u'Jessica Lange', u'Teri G...
Back to the Future Part III                        [u'Michael J. Fox', u'Christopher Lloyd', u'Ma...
Master and Commander: The Far Side of the World    [u'Russell Crowe', u'Paul Bettany', u'Billy Bo...
Poltergeist                                        [u'JoBeth Williams', u"Heather O'Rourke", u'Cr...
Wall Street                                        [u'Charlie Sheen', u'Michael Douglas', u'Tamar...
Name: actors_list, Length: 979, dtype: object

In [46]:
# Multiple row and column selections using iloc and DataFrame
df.iloc[0:5] # First five rows of dataframe
df.iloc[:, 0:2] # First two columns of data frame with all rows
df.iloc[[0,3,6,24], [0,2]] # 1st, 4th, 7th, 25th row + 1st and 3rd columns
df.iloc[:5, 0] # First 5 rows and first column of DataFrame

title
The Shawshank Redemption    9.3
The Godfather               9.2
The Godfather: Part II      9.1
The Dark Knight             9.0
Pulp Fiction                8.9
Name: star_rating, dtype: float64

In [47]:
# Getting actors_list of first row
# METHOD 1
print(df.iloc[0,4])

# METHOD 2 - as df.iloc[0] is a Series, you can also get the actors_list like this
print(df.iloc[0]["actors_list"])

[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunton']
[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunton']

In [48]:
# If you prefer to use the keys, then you need to use loc:
df.loc["The Usual Suspects"]

star_rating                                                     8.7
content_rating                                                    R
genre                                                         Crime
duration                                                        106
actors_list       [u'Kevin Spacey', u'Gabriel Byrne', u'Chazz Pa...
Name: The Usual Suspects, dtype: object

In [49]:
df.loc["The Usual Suspects", "actors_list"]

"[u'Kevin Spacey', u'Gabriel Byrne', u'Chazz Palminteri']"

In [50]:
df.loc["Blue Valentine":, ["genre", "duration"]]

                                                     genre  duration
title
Blue Valentine                                       Drama       112
The Cider House Rules                                Drama       126
Tootsie                                             Comedy       116
Back to the Future Part III                      Adventure       118
Master and Commander: The Far Side of the World     Action       138
Poltergeist                                         Horror       114
Wall Street                                          Crime       126

### Filtering data using boolean conditions

In [51]:
# Let's retrieve only "Drama" movies
drama_movies_bool = df['genre'] == "Drama"
drama_movies_bool.head()

title
The Shawshank Redemption    False
The Godfather               False
The Godfather: Part II      False
The Dark Knight             False
Pulp Fiction                False
Name: genre, dtype: bool

In [52]:
drama_movies = df.loc[drama_movies_bool]
drama_movies.head()

,star_rating,content_rating,genre,duration,actors_list
title,,,,,
12 Angry Men,8.9,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
Fight Club,8.9,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
Forrest Gump,8.8,PG-13,Drama,142,"[u'Tom Hanks', u'Robin Wright', u'Gary Sinise']"
One Flew Over the Cuckoo's Nest,8.7,R,Drama,133,"[u'Jack Nicholson', u'Louise Fletcher', u'Mich..."
Seven Samurai,8.7,UNRATED,Drama,207,"[u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K..."

In [53]:
top_movies = df.loc[df["star_rating"] > 9, ["star_rating"]]
top_movies

                          star_rating
title
The Shawshank Redemption          9.3
The Godfather                     9.2
The Godfather: Part II            9.1

#  Data modification

##  Adding/removing columns & rows

In [54]:
# 1. Column with a fixed value 
df["type"] = "movie"

# 2. Column based on an other column
df["long_movie"] = df["duration"] > 160

# 3. Column created with a lambda function
# We need to use eval function as actors_list contains strings
df["main_actor"] = df["actors_list"].apply(lambda x: eval(x)[0])

df.head()

,star_rating,content_rating,genre,duration,actors_list,type,long_movie,main_actor
title,,,,,,,,
The Shawshank Redemption,9.3,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...",movie,False,Tim Robbins
The Godfather,9.2,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']",movie,True,Marlon Brando
The Godfather: Part II,9.1,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv...",movie,True,Al Pacino
The Dark Knight,9.0,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E...",movie,False,Christian Bale
Pulp Fiction,8.9,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L....",movie,False,John Travolta

In [55]:
df = df.drop(['type'], axis=1) # axis=1 corresponds to column, axis=0 corresponds to row
df.head()

,star_rating,content_rating,genre,duration,actors_list,long_movie,main_actor
title,,,,,,,
The Shawshank Redemption,9.3,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...",False,Tim Robbins
The Godfather,9.2,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']",True,Marlon Brando
The Godfather: Part II,9.1,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv...",True,Al Pacino
The Dark Knight,9.0,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E...",False,Christian Bale
Pulp Fiction,8.9,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L....",False,John Travolta

## Handling missing values

In [56]:
# Let's import a new dataset
new_df = pd.read_csv('donnees/class-grades.csv')
new_df.head(10)

   Prefix  Assignment  Tutorial  Midterm TakeHome  Final
0       5       57.14     34.09    64.38    51.48   52.5
1       8       95.05    105.49    67.50    99.07  68.33
2       8       83.70     83.17    30.00    63.15  48.89
3       7       81.22     96.06    49.38   105.93  80.56
4       8       91.32     93.64    95.00   107.41  73.89
5       7       95.00     92.58    93.12    97.78  68.06
6       8       95.05    102.99    56.25    99.07     50
7       7       72.85     86.85    60.00        ?  56.11
8       8       84.26     93.10    47.50    18.52  50.83
9       7       90.10     97.55    51.25    88.89  63.61

In [57]:
# Unfortunately, it doesn't tell us a lot about it!
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 6 columns):
Prefix        99 non-null int64
Assignment    99 non-null float64
Tutorial      99 non-null float64
Midterm       99 non-null float64
TakeHome      99 non-null object
Final         99 non-null object
dtypes: float64(3), int64(1), object(2)
memory usage: 4.8+ KB

In [59]:
new_df = pd.read_csv('donnees/class-grades.csv', na_values=['?'])

In [60]:
# Now, we can check that the number of non-null values has been properly updated!
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 6 columns):
Prefix        99 non-null int64
Assignment    99 non-null float64
Tutorial      99 non-null float64
Midterm       99 non-null float64
TakeHome      98 non-null float64
Final         96 non-null float64
dtypes: float64(5), int64(1)
memory usage: 4.8 KB

In [61]:
# Well we have some NaN in our data
# A naive approach would be to remove them
drop_df = new_df.dropna()
drop_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 95 entries, 0 to 98
Data columns (total 6 columns):
Prefix        95 non-null int64
Assignment    95 non-null float64
Tutorial      95 non-null float64
Midterm       95 non-null float64
TakeHome      95 non-null float64
Final         95 non-null float64
dtypes: float64(5), int64(1)
memory usage: 5.2 KB

## Concatenation and merging

###  `concat()`

In [62]:
# Let's create two series
s1 = pd.Series(['apple', 'orange', 'banana'],
               index=[1, 2, 4])
s2 = pd.Series(['pineapple', 'wildberry', 'raspberry'],
               index=[3, 2, 6])

print(s1)
print(s2)

1     apple
2    orange
4    banana
dtype: object
3    pineapple
2    wildberry
6    raspberry
dtype: object

In [63]:
# What if we concatenate them?
pd.concat([s1, s2], axis=0)

1        apple
2       orange
4       banana
3    pineapple
2    wildberry
6    raspberry
dtype: object

In [64]:
# What if we concatenate them?
pd.concat([s1, s2], axis=1)

        0          1
1   apple        NaN
2  orange  wildberry
3     NaN  pineapple
4  banana        NaN
6     NaN  raspberry

###  `merge()`

In [65]:
# Let's create two new dataframes
meal = ['pizza', 'pasta', 'burger']
prices = [11.8, 12.9, 15.60]
calories = [870, 790, 950]

prices = pd.DataFrame({'meal': meal, 'prices': prices})
calories = pd.DataFrame(calories, index=meal, columns=['calories'])

In [66]:
prices

     meal  prices
0   pizza    11.8
1   pasta    12.9
2  burger    15.6

In [67]:
calories

        calories
pizza        870
pasta        790
burger       950

In [68]:
# We can merge them in a smart way:
prices.merge(calories, left_on='meal', right_index=True)

     meal  prices  calories
0   pizza    11.8       870
1   pasta    12.9       790
2  burger    15.6       950

> ### iloc et loc

In [12]:
s.iloc[3]

'South Korea'

In [13]:
s.loc['Golf']

'Scotland'

In [14]:
s[3]

'South Korea'

In [15]:
s['Golf']

'Scotland'

In [16]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)

In [17]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [18]:
total = 0
for item in s:
    total+=item
print(total)

324.0

In [19]:
import numpy as np

total = np.sum(s)
print(total)

324.0

In [20]:
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [21]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)

In [22]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [23]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [24]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [25]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [68]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [69]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [70]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [71]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [72]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [73]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [74]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [75]:
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [76]:
df.loc[:,['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [77]:
df.drop('Store 1')

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [78]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [79]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [80]:
copy_df.drop?

In [40]:
del copy_df['Name']
copy_df

        Item Purchased  Cost
Store 2      Bird Seed   5.0

In [41]:
df['Location'] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevyn   Kitty Litter   2.5     None
Store 2  Vinod      Bird Seed   5.0     None

# Dataframe Indexing and Loading

In [ ]:
costs = df['Cost']
costs

In [ ]:
costs+=2
costs

In [ ]:
df

In [ ]:
!cat olympics.csv

In [ ]:
df = pd.read_csv('olympics.csv')
df.head()

In [ ]:
df = pd.read_csv('olympics.csv', index_col = 0, skiprows=1)
df.head()

In [ ]:
df.columns

In [ ]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold' + col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver' + col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze' + col[4:]}, inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#' + col[1:]}, inplace=True) 

df.head()

# Querying a DataFrame

In [ ]:
df['Gold'] > 0

In [ ]:
only_gold = df.where(df['Gold'] > 0)
only_gold.head()

In [ ]:
only_gold['Gold'].count()

In [ ]:
df['Gold'].count()

In [ ]:
only_gold = only_gold.dropna()
only_gold.head()

In [ ]:
only_gold = df[df['Gold'] > 0]
only_gold.head()

In [ ]:
len(df[(df['Gold'] > 0) | (df['Gold.1'] > 0)])

In [ ]:
df[(df['Gold.1'] > 0) & (df['Gold'] == 0)]

# Indexing Dataframes

In [ ]:
df.head()

In [ ]:
df['country'] = df.index
df = df.set_index('Gold')
df.head()

In [ ]:
df = pd.read_csv('census.csv')
df.head()

In [ ]:
df['SUMLEV'].unique()

In [ ]:
df=df[df['SUMLEV'] == 50]
df.head()

In [ ]:
columns_to_keep = ['STNAME',
                   'CTYNAME',
                   'BIRTHS2010',
                   'BIRTHS2011',
                   'BIRTHS2012',
                   'BIRTHS2013',
                   'BIRTHS2014',
                   'BIRTHS2015',
                   'POPESTIMATE2010',
                   'POPESTIMATE2011',
                   'POPESTIMATE2012',
                   'POPESTIMATE2013',
                   'POPESTIMATE2014',
                   'POPESTIMATE2015']
df = df[columns_to_keep]
df.head()

In [ ]:
df = df.set_index(['STNAME', 'CTYNAME'])
df.head()

In [ ]:
df.loc['Michigan', 'Washtenaw County']

In [ ]:
df.loc[ [('Michigan', 'Washtenaw County'),
         ('Michigan', 'Wayne County')] ]

# Missing values

In [ ]:
df = pd.read_csv('log.csv')
df

In [ ]:
df.fillna?

In [ ]:
df = df.set_index('time')
df = df.sort_index()
df

In [ ]:
df = df.reset_index()
df = df.set_index(['time', 'user'])
df

In [ ]:
df = df.fillna(method='ffill')
df.head()